ルミーズ決済プラグイン（3.0系） (ルミーズ株式会社)
リリースノート（対応バージョン：EC-CUBE 3.0.4～3.0.14）

■ver1.0.13(2017/05/25)
・ドコモケータイ払い（都度決済）に対応しました。

■ver1.0.12(2017/04/11)
・EC-CUBE 3.0.14 に対応しました。
・カード決済時のパラメータ情報を追加しました。
・エラー発生時のログ出力先を追加しました。

■ver1.0.11(2016/12/26)
・EC-CUBE 3.0.13 に対応しました。
・結果通知時の在庫数チェック処理を追加しました。
・支払方法追加時の不具合を修正しました。

■ver1.0.10(2016/11/01)
・EC-CUBE 3.0.12 に対応しました。

■ver1.0.9(2016/09/28)
・EC-CUBE 3.0.11 に対応しました。
　（EC-CUBE 3.0.11 のトランザクションの挙動変更に伴う対応）
・特定の環境化でマルチ決済の文字化けが起こる不具合を改善しました。
・クレジットカード決済の支払方法が編集できない不具合を改善しました。（EC-CUBE3.0.10以降対象）

■ver1.0.8(2016/06/17)
・拡張セットの結果表示に対応しました。

■ver1.0.7(2016/06/06)
・受注完了時の他プラグインへの通知機能に対応しました。

■ver1.0.6(2016/05/16)
・EC-CUBE 3.0.10 に対応しました。

■ver1.0.5(2016/04/13)
・マルチ決済（コンビニ・電子マネー・銀行決済）機能を実装しました。
・ペイクイック機能で登録したカード情報を削除する機能を追加しました。

■ver1.0.4(2016/03/08)
・EC-CUBE 3.0.9 に対応しました。
・ペイクイック機能を追加しました。
・ルミーズ決済のログ閲覧機能を追加しました。
・文字化けの不具合を修正しました。

■ver1.0.2(2016/01/14)
・EC-CUBE 3.0.6～3.0.8 に対応しました。

■ver1.0.1(2015/11/16)
・EC-CUBE 3.0.5 に対応しました。

■ver1.0.0(2015/10/16)
・EC-CUBE 3.0.2 ～ 3.0.4 に対応しました。
・クレジットカード決済機能を実装しました。
